#!/usr/bin/env python
# -*- coding: utf-8 -*-
from math import cos,log, pow

print('==============================================================')
print(' Введите значения переменных:')
a = float(input(' a = '))
x = float(input(' x = '))
print('==============================================================')
print(' Введите номер функции (G - 1; F - 2; Y - 3):')
b = int(input(' Номер функции: '))
print('==============================================================')
if (b == 1 and a != 0 and x != 0):
    G = (5*(9*pow(a,2)-26*a*x+16*pow(x,2)))/(20*pow(a,2)+29*a*x+5*pow(x,2))
    print(' G = %.6f' % G)
elif b == 2:
    F = (1/cos(14*pow(a,2)-19*a*x+6*pow(x,2)))
    print(' F = %.6f' % F)
elif (b == 3 and x > a):
    Y = (log(-80*pow(a,2)+6*a*x+35*pow(x,2)+1)/log(10))
    print(' Y = %.6f' % Y)
else:
    print(' Введён неверный номер формулы и/или невозможно посчитать!')
print('==============================================================')
